# Задайте список из n чисел последовательности 
# (1+ 1/n)^n и выведите на экран их сумму.
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
# Вывод: 14.031 (2 + 2.25 + 2.37 + 2.441 + 2.448 + 2.522)

print ('Введите число: ')
a = int(input())
sum=0

b = [round((1+1/i)**i, 3) for i in range(1,a+1)]
print(b)

for i in b:
    sum += i
print(sum)